KizEvo/stm32-rfid-sdcard-servo-test/Src/mfrc522.c
/* ============================================================================
 *
 * mfrc522.c
 *
 * Created on: Feb 28, 2024
 * Author: Nguyen Duc Phu
 *
 * ============================================================================
 */

#include <stdint.h>
#include <stdlib.h>
#include "mfrc522.h"
#include "spi.h"
#include "tim.h"
#include "stm32f10x.h"
#include "uart.h"

// Define the required address byte format Section 8.1.2.3
#define MFRC522_ADDRESS_BYTE_FORMAT(mode, address) ((uint8_t)(((mode) | ((address) << 1)) & 0xFE))
// Mode for MFRC522 address byte
#define ADDRESS_BYTE_FORMAT_WRITE 0x00
#define ADDRESS_BYTE_FORMAT_READ	0x80

// Reset MFRC522 and turn on analog part of receiver
// Delay after issuing soft reset command doing this let crystal starts up (Section 8.8.2)
#define MFRC522_SOFT_RESET \
	MFRC522_WriteByteReg(CommandReg, SoftReset);\
	delayMs(1000); 
  

/*============================================================================
 *
 * Initialize MFRC522 module, setup various registers
 *
 *============================================================================
 */
void MFRC522_Init(void)
{
	MFRC522_SOFT_RESET;

	// Reset data rate during transmission/reception, set bit rate 106 kBd
	MFRC522_WriteByteReg(TxModeReg, 0x00);
	MFRC522_WriteByteReg(RxModeReg, 0x00);
	// Reset Miller modulation width to default value
	MFRC522_WriteByteReg(ModWidthReg, 0x26);
	
	// Config timer to enable timeout checks
	MFRC522_WriteByteReg(TModeReg, 0x80); // Timer start automatically at the end of transmission in all communication mode
	MFRC522_WriteByteReg(TPrescalerReg, 0xA9); // ftimer = 13.56 MHz / (2*TPreScaler+1). => Ttimer = 25 us
	MFRC522_WriteByteReg(TReloadRegH, 0x03); // Upper 4 bits of TReloadReg
	MFRC522_WriteByteReg(TReloadRegL, 0xE8); // Lower 8 bits of TReloadReg, set TReloadReg = 0x3E8 = 1000 => Ttimer * 1000 = 25ms before timeout
	MFRC522_WriteByteReg(TxASKReg, 0x40); // Write to bit 6 => forces a 100 % ASK modulation independent of the ModGsPReg register setting
	MFRC522_WriteByteReg(ModeReg, 0x3D); // Change CRC preset value to 0x6363
	
	// Enable the antenna - 0x80 is the default value, 0x03 to turn on TX1 and TX2
	MFRC522_WriteByteReg(TxControlReg, 0x83);
}

/*============================================================================
 *
 * Write a byte to a MFRC522 register address using SPI interface
 *
 *============================================================================
 */
void MFRC522_WriteByteReg(uint8_t regAddr, uint8_t valueToWrite)
{
	// NSS (Chip Select) pin, pulled low to enable slave
	GPIO_WriteBit(GPIOA, GPIO_Pin_4, Bit_RESET); 
	// Format address according to datasheet
	uint8_t addr = MFRC522_ADDRESS_BYTE_FORMAT(ADDRESS_BYTE_FORMAT_WRITE, regAddr);
	// Write sequence, [addr, data] Section 8.1.2.2
	SPI_TransmitByte(SPI1, addr);
	SPI_TransmitByte(SPI1, valueToWrite);
	// NSS pin, pulled high to disable slave
	GPIO_WriteBit(GPIOA, GPIO_Pin_4, Bit_SET);
}

/*============================================================================
 *
 * Write byte stream to a MFRC522 register address using SPI interface
 *
 *============================================================================
 */
void MFRC522_WriteStreamReg(uint8_t regAddr, uint8_t *valueStream, uint8_t streamLen)
{
	// NSS (Chip Select) pin, pulled low to enable slave
	GPIO_WriteBit(GPIOA, GPIO_Pin_4, Bit_RESET); 
	// Format address according to datasheet
	uint8_t addr = MFRC522_ADDRESS_BYTE_FORMAT(ADDRESS_BYTE_FORMAT_WRITE, regAddr);
	// Write sequence, [addr, data0, data1, data2, ...] Section 8.1.2.2
	SPI_TransmitByte(SPI1, addr);
	for(uint8_t i = 0; i < streamLen; i++)
	{
		SPI_TransmitByte(SPI1, valueStream[i]);
		for(volatile uint8_t j = 0; j < UINT8_MAX; j++);
	}
	// NSS pin, pulled high to disable slave
	GPIO_WriteBit(GPIOA, GPIO_Pin_4, Bit_SET);
}

/*============================================================================
 *
 * Read a byte from a MFRC522 register address using SPI interface
 *
 *============================================================================
 */
uint8_t MFRC522_ReadByteReg(uint8_t regAddr)
{
	uint8_t result;
	// NSS (Chip Select) pin, pulled low to enable slave
	GPIO_WriteBit(GPIOA, GPIO_Pin_4, Bit_RESET);
	// Format address according to datasheet
	uint8_t addr = MFRC522_ADDRESS_BYTE_FORMAT(ADDRESS_BYTE_FORMAT_READ, regAddr);
	// Read sequence Section 8.1.2.1
	// MOSI = [addr0, addr1, addr2, ...]
	// MISO = [  X  , data0, data1, ...], X = dont care
	SPI_TransmitByte(SPI1, addr);      // send addr0, addr0 contains value we want to read from
	SPI_ReceiveByte(SPI1, &result, 5); // result = X
	SPI_TransmitByte(SPI1, 0x00);      // Send 0x00 to stop reading
	SPI_ReceiveByte(SPI1, &result, 5); // result = data0
	// NSS pin, pulled high to disable slave
	GPIO_WriteBit(GPIOA, GPIO_Pin_4, Bit_SET);
	
	return result;
}

/*============================================================================
 *
 * Read byte stream from a MFRC522 register address using SPI interface
 *
 *============================================================================
 */
void MFRC522_ReadStreamReg(uint8_t regAddr, uint8_t *valueStream, uint8_t streamLen)
{
	// NSS (Chip Select) pin, pulled low to enable slave
	GPIO_WriteBit(GPIOA, GPIO_Pin_4, Bit_RESET);
	// Format address according to datasheet
	uint8_t addr = MFRC522_ADDRESS_BYTE_FORMAT(ADDRESS_BYTE_FORMAT_READ, regAddr);
	// Read sequence Section 8.1.2.1
	// MOSI = [addr0, addr1, addr2, ...]
	// MISO = [  X  , data0, data1, ...], X = dont care
	uint8_t tmp;
	SPI_TransmitByte(SPI1, addr); // addr0
	SPI_ReceiveByte(SPI1, &tmp, 5); // X
	for(uint8_t i = 0; i < streamLen - 1; i++) // streamLen - 1 because the last read is outside loop
	{
		SPI_TransmitByte(SPI1, addr); // addr1, addr2, ...
		SPI_ReceiveByte(SPI1, &(valueStream[i]), 5); // data0, data1, ...
	}
	SPI_TransmitByte(SPI1, 0x00); // Send 0x00 to stop reading.
	SPI_ReceiveByte(SPI1, &(valueStream[streamLen - 1]), 5); // Read the final byte. 
	// NSS pin, pulled high to disable slave
	GPIO_WriteBit(GPIOA, GPIO_Pin_4, Bit_SET);
}

/*============================================================================
 *
 * Set the bits specified in 'bitmask' in register 'regAddr'
 *
 *============================================================================
 */
void MFRC522_SetRegisterBitMask(uint8_t regAddr, uint8_t bitmask)
{
	uint8_t regValueTmp = MFRC522_ReadByteReg(regAddr);
	MFRC522_WriteByteReg(regAddr, regValueTmp | bitmask);
}


/*============================================================================
 *
 * Clear the bits specified in 'bitmask' in register 'regAddr'
 *
 *============================================================================
 */
void MFRC522_ClearRegisterBitMask(uint8_t regAddr, uint8_t bitmask)
{
	uint8_t regValueTmp = MFRC522_ReadByteReg(regAddr);
	MFRC522_WriteByteReg(regAddr, regValueTmp & (~(bitmask)));
}

/*============================================================================
 *
 * Transfers data to the MFRC522 FIFO, executes a command, waits for completion and transfers data back from the FIFO.
 * xIRq : indicates which bit in the ComIrqReg should be checked to handle communication appropriately
 * validBits : used for transmission of bit oriented frames: defines the number of bits of the last byte that will be transmitted 
 * rxAlign : used for reception of bit-oriented frames: defines the bit position for the first bit received to be stored in the FIFO buffer
 *============================================================================
 */
uint8_t MFRC522_PICC_Communication(uint8_t command, uint8_t xIRq, uint8_t *sendValStream, uint8_t *sendValLen, uint8_t *receiveValStream, uint8_t *receiveValLen, uint8_t *validBits, uint8_t rxAlign, uint8_t checkCRC)
{
	// Prepare values for BitFramingReg
	uint8_t txLastBits = validBits ? *validBits : 0;
	uint8_t bitFraming = (rxAlign << 4) | txLastBits;		// RxAlign = BitFramingReg[6..4]. TxLastBits = BitFramingReg[2..0]
	
	MFRC522_WriteByteReg(CommandReg, Idle); // No action, cancels current command execution Table 149 - 10.3 MFRC522
	MFRC522_WriteByteReg(ComIrqReg, 0x7F); // Bit 7 = 0 => indicates that the marked bits in the ComIrqReg register are cleared
	MFRC522_WriteByteReg(FIFOLevelReg, 0x80); // Flush FIFO register
	MFRC522_WriteStreamReg(FIFODataReg, sendValStream, *sendValLen); // Write stream to FIFO register (total 64 bytes)
	MFRC522_WriteByteReg(BitFramingReg, bitFraming); // Config bit frame for transmission and reception
	MFRC522_WriteByteReg(CommandReg, command); // Execute the command

	if(command == Transceive) // Transmission of data start, need to activate bit 7th of BitFramingReg if command is Transceive to start sending data to PICC
	{
		MFRC522_SetRegisterBitMask(BitFramingReg, 0x80);
	}
	
	startTimeOutMs(100); // Wait 25ms at the end of transmission (because we set the TAuto bit in TModeReg) for other command to complete
	uint8_t completed = 0;
	uint8_t irqReg;
	while(!(checkTimeOut()))
	{
		irqReg = MFRC522_ReadByteReg(ComIrqReg);
		if(irqReg & xIRq) // Interrupt signals success communication
		{
			endTimeOutMs();
			completed = 1;
			break;
		}
		if(irqReg & 0x01) // Timeout by internal timer of MFRC522
		{
			endTimeOutMs();
			return 0;
		}
	}
	endTimeOutMs();
	
	if(!completed) // Timeout by systick interrupt
	{
		return 0;
	}
	
	uint8_t errorReg = MFRC522_ReadByteReg(ErrorReg);
	if(errorReg & 0x13) // BufferOvfl, ParityErr, ProtocolErr checks
	{
		return 1;
	}
	
	uint8_t validBitsReceived = 0;
	
	if(receiveValStream && receiveValLen)
	{
		uint8_t byteCountInFIFO = MFRC522_ReadByteReg(FIFOLevelReg); // Get number of bytes in FIFO
		if (byteCountInFIFO > *receiveValLen) // Not enough room to write back data from MFRC522_FIFO to MCU
		{
			return 2;
		}
		*receiveValLen = byteCountInFIFO;
		MFRC522_ReadStreamReg(FIFODataReg, receiveValStream, *receiveValLen);
		validBitsReceived = MFRC522_ReadByteReg(ControlReg) & 0x07;
		if(validBits) // If no error, after this assignment validBits should be 0b000 indicates the whole byte is valid
		{
			*validBits = validBitsReceived;
		}
	}
	
	if (errorReg & 0x08) // CollErr
	{
		return 3;
	}
	
	// Perform no CRC check
	if(receiveValStream && receiveValLen && checkCRC)
	{
		if(*receiveValLen == 1 && validBitsReceived == 4)
		{
			return 4;
		}
		if(*receiveValLen < 2 || validBitsReceived != 0)
		{
			return 5;
		}
		uint8_t controlBuffer[2];
		uint8_t status = MFRC522_CalculateCRC(&receiveValStream[0], *receiveValLen - 2, &controlBuffer[0]);
		if(status != UINT8_MAX)
		{
			return status;
		}
		if ((receiveValStream[*receiveValLen - 2] != controlBuffer[0]) || (receiveValStream[*receiveValLen - 1] != controlBuffer[1])) 
		{
			return 6;
		}
	}
	return UINT8_MAX; // Success
}


/*============================================================================
 *
 * Execute Transceive command
 *
 *============================================================================
 */
uint8_t MFRC522_PICC_TransceiveData(uint8_t *sendValStream, uint8_t *sendValLen, uint8_t *receiveValStream, uint8_t *receiveValLen, uint8_t *validBits, uint8_t rxAlign, uint8_t checkCRC)
{
	uint8_t xIRq = 0x30; // RxIRq and IdleIRq
	return MFRC522_PICC_Communication(Transceive, xIRq, sendValStream, sendValLen, receiveValStream, receiveValLen, validBits, rxAlign, checkCRC);
}

/*============================================================================
 *
 * Transmit REQA commands to PICC to change PICC state from HALT to READY state
 *
 *============================================================================
 */
uint8_t MFRC522_PICC_RequestA(uint8_t *bufferATQA, uint8_t *bufferSize)
{
	uint8_t validBits = 7;
	uint8_t sendValStream = 0x26; // REQA command, Section 6.3.1 ISO-IEC 14443-3_E
	uint8_t sendValLen = 1;

	if(bufferATQA == NULL || *bufferSize < 2)
	{
		return 0;
	}
	
	MFRC522_ClearRegisterBitMask(CollReg, 0x80);
	uint8_t status = MFRC522_PICC_TransceiveData(&sendValStream, &sendValLen, bufferATQA, bufferSize, &validBits, 0, 0);
	
	if (status != UINT8_MAX)
	{
		return status;
	}
	if (*bufferSize != 2 || validBits != 0)
	{
		return 1;
	}
	return UINT8_MAX; // Success
}

/*============================================================================
 *
 * Use the CRC coprocessor in the MFRC522 to calculate CRC_A 
 * *result : Low byte is written first, result[0] = RegLow, result[1] = RegHigh, Check Annex B CRC_A and CRC_B encoding
 *
 *============================================================================
 */
uint8_t MFRC522_CalculateCRC(uint8_t *valueStream, uint8_t streamLen, uint8_t *result)
{
	MFRC522_WriteByteReg(CommandReg, Idle); // No action, cancels current command execution Table 149 - 10.3 MFRC522
	MFRC522_WriteByteReg(DivIrqReg, 0x04); // bit 7 = 0 => indicates that the marked bits in the DivIrqReg register are cleared => CRCIrq[2] is cleared
	MFRC522_WriteByteReg(FIFOLevelReg, 0x80); // Flush FIFO register
	MFRC522_WriteStreamReg(FIFODataReg, valueStream, streamLen); // Write stream to FIFO register (total 64 bytes)
	MFRC522_WriteByteReg(CommandReg, 0x03); // Activates the CRC coprocessor
	
	startTimeOutMs(90); // Wait 90ms at the end of transmission for the CRC command to complete
	while(!(checkTimeOut()))
	{
		uint8_t regValue = MFRC522_ReadByteReg(DivIrqReg);
		if(regValue & 0x04) // CRCIrq is set => the CalcCRC command is active and all data is processed
		{
			MFRC522_WriteByteReg(CommandReg, Idle); // Cancels the CalcCRC command
			endTimeOutMs(); // Clear timeout flag
			result[0] = MFRC522_ReadByteReg(CRCResultRegL);
			result[1] = MFRC522_ReadByteReg(CRCResultRegH);
			return UINT8_MAX; // Calculate CRC success
		}
	}
	endTimeOutMs(); // Clear timeout flag
	return 0; // Timeout
}

/*============================================================================
 *
 * Transmits SELECT/ANTICOLLISION commands to select a single PICC.
 * You have to issue REQA command before using this function
 * Take a loot of the Annex A, Communication example Type A ISO-IEC 14443-3
 *
 *============================================================================
 */
uint8_t MFRC522_PICC_Select(UID *uid)
{
	// Variables implement here
	uint8_t cascadeLevel = 1;
	uint8_t uidCompleted;
	uint8_t useCascadeTag;
	uint8_t selectDone;
	uint8_t result;
	uint8_t count;
	uint8_t checkBit;
	uint8_t rxAlign;                // Used in BitFramingReg. Defines the bit position for the first bit received
	uint8_t txLastBits;             // Used in BitFramingReg. The number of valid bits in the last transmitted byte.
	uint8_t uidIndex;               // Index in uid->uidByte[uidIndex] that is used in the current Cascade level
	int8_t currentLvlKnownBits;     // The number of known UID bits in the current Cascade Level
	uint8_t *responseBuffer;
	uint8_t responseLength;
	uint8_t bufferUsed;             // The number of bytes to transfer to the FIFO.
	uint8_t buffIndex;              // Buffer index
	uint8_t buffer[9];
	
