KizEvo/stm32-rfid-sdcard-servo-test/Src/mfrc522.c
	// Description of buffer structure:
	//		Byte 0: SEL               Indicates the Cascade Level: 1, 2 or 2
	//		Byte 1: NVB               Number of Valid Bits (in complete command, not just the UID): High nibble: complete bytes, Low nibble: Extra bits. 
	//		Byte 2: UID-data or CT		CT means Cascade Tag.
	//		Byte 3: UID-data
	//		Byte 4: UID-data
	//		Byte 5: UID-data
	//		Byte 6: BCC					      Block Check Character - XOR of byte 2 to byte 5
	//		Byte 7: CRC_A
	//		Byte 8: CRC_A
	
	MFRC522_ClearRegisterBitMask(CollReg, 0x80);
	
	// Repeat Cascade level loop until we have a complete UID.
	uidCompleted = 0;
	while(!uidCompleted)
	{
		switch(cascadeLevel)
		{
			case 1:
				buffer[0] = 0x93; // AntiCollision Cascade level 1, 6.4.3.2 Coding of SEL (Select code)
				uidIndex = 0;
				useCascadeTag = (uid->size > 4);
				break;
			case 2:
				buffer[0] = 0x95; // Cascade level 2
				uidIndex = 3;
				useCascadeTag = (uid->size > 7);
				break;
			case 3:
				buffer[0] = 0x97; // Cascade level 3
				uidIndex = 6;
				useCascadeTag = 0;
			default:
				return 0; // Internal error
		}
		// Check how many uid bits are known in this Cascade level
		currentLvlKnownBits = 8 * uidIndex;
		
		// Copy the known bits from uid->uidByte[] to buffer[]
		buffIndex = 2;
		if(useCascadeTag)
		{
			buffer[buffIndex++] = 0x88; // Cascade tag, check Annex A for sample communication with Cascade tag
		}
		uint8_t bytesToCopy = currentLvlKnownBits / 8 + (currentLvlKnownBits % 8 ? 1 : 0);
		if(bytesToCopy)
		{
			uint8_t maxByte = useCascadeTag ? 3 : 4; // Max 4 bytes of UID in each Cascade Level. Only 3 bytes of UID left if we use the Cascade Tag
			if(bytesToCopy > maxByte)
			{
				bytesToCopy = maxByte;
			}
			for(count = 0; count < bytesToCopy; count++)
			{
				buffer[buffIndex++] = uid->uidByte[uidIndex + count];
			}
		}
		
		// Now that the data has been copied we need to include the 8 bits in CT in currentLvlKnownBits
		if (useCascadeTag) 
		{
			currentLvlKnownBits += 8;
		}
		
		// Repeat anti collision loop until we can transmit all UID bits + BCC and receive a SAK - max 32 iteration
		selectDone = 0;
		while(!selectDone)
		{
			// Find out how many bits and bytes to send and receive
			if(currentLvlKnownBits >= 32) // This is a SELECT full frame and can be sent to PICC.
			{
				buffer[1] = 0x70; // NVB - number of valid bytes: seven whole bytes, SEL -> BCC (exclude 2 bytes CRC_A)
				// Calculate BCC - Block Check Character
				buffer[6] = buffer[2] ^ buffer[3] ^ buffer[4] ^ buffer[5];
				// Calculate CRC_A
				result = MFRC522_CalculateCRC(buffer, 7, &buffer[7]);
				if(result != UINT8_MAX) // If NOT OK then return
				{
					return result;
				}
				txLastBits = 0; // 0b000 => All bits of the last byte is valid.
				bufferUsed = 9;
				
				// Store response in the last 3 bytes of buffer (BCC and CRC_A - not needed after tx)
				responseBuffer	= &buffer[6];
				responseLength	= 3;
			}
			else // ANTICOLLISION
			{
				// Section 6.4.3.3
				txLastBits = currentLvlKnownBits % 8; // The lower 4 bits are called ¡°bit count¡± and specify the number of all valid data bits transmitted by the PCD (including SEL and NVB) modulo 8.
				count = currentLvlKnownBits / 8; // Number of whole bytes in the UID part
				buffIndex = 2 + count; // Number of whole bytes: SEL + NVB + UIDs
				buffer[1] = (buffIndex << 4) | txLastBits; // NVB - Number of Valid Bits
				bufferUsed = buffIndex + (txLastBits ? 1 : 0);
				// Store response in the unused part of buffer
				responseBuffer	= &buffer[buffIndex];
				responseLength	= sizeof(buffer) - buffIndex;
			}
			
			// Set bit adjustment
			rxAlign = txLastBits;
			MFRC522_WriteByteReg(BitFramingReg, (rxAlign << 4) | txLastBits); // rxAlign = BitFramingReg[6..4]. txLastBits = BitFramingReg[2..0]
			
			// Transmit the buffer and receive the response
			result = MFRC522_PICC_TransceiveData(buffer, &bufferUsed, responseBuffer, &responseLength, &txLastBits, rxAlign, 0);
			
			if(result == 3) // More than one PICC in the field => collision error
			{
				uint8_t valueOfCollReg = MFRC522_ReadByteReg(CollReg); // CollReg[7..0] bits are: ValuesAfterColl reserved CollPosNotValid CollPos[4:0]
				if (valueOfCollReg & 0x20) // CollPosNotValid
				{
					return 3; // Without a valid collision position we cannot continue
				}
				
				uint8_t collisionPos = valueOfCollReg & 0x1F; //shows the bit position of the first detected collision in a received frame, -> check bit from 0-31, 0x00 means bit 32nd
				if (collisionPos == 0)
				{
					collisionPos = 32;
				}
				if (collisionPos <= currentLvlKnownBits) // No progress - should not happen
				{
					return 0; // Internal error
				}
				// Choose the PICC with the bit set, for example in Annex A ISO IEC 14443-3, first bit collision happened at bit 4th
				currentLvlKnownBits = collisionPos;
				count = currentLvlKnownBits % 8; // count = 4
				checkBit = (currentLvlKnownBits - 1) % 8; // checkBit = 3
				buffIndex = 1 + (currentLvlKnownBits / 8) + (count ? 1 : 0); // First byte is index 0 // buffIndex = 1 + 0 + 1 = 2;
				buffer[buffIndex] |= (1 << checkBit); // buffer order: SEL NVB UID0 UID1 UID2 UID3
				                                      //                0   1   2    3    4    5
				                                      // So this means we set the first collision bit in UID0
			}
			else if(result != UINT8_MAX)
			{
				return result;
			}
			else // Status ok => UINT8_MAX
			{
				if (currentLvlKnownBits >= 32) // This was a SELECT
				{
					selectDone = 1; // No more anti collision
					// Continue below outside the while
				}
				else // This was an anti collision
				{
					// We now have all 32 bits of the UID in this Cascade level
					currentLvlKnownBits = 32;
					// Run loop again to do the SELECT
				}
			}
		} // End of while(!selectDone)
		
		// Copy the found UID bytes from buffer[] to uid->uidByte[]
		buffIndex = (buffer[2] == 0x88) ? 3 : 2; // 0x88 Cascade tag // source index in buffer[]
		bytesToCopy = (buffer[2] == 0x88) ? 3 : 4;
		for (count = 0; count < bytesToCopy; count++)
		{
			uid->uidByte[uidIndex + count] = buffer[buffIndex++];
		}
		
		// Check response SAK (Select Acknowledge)
		if (responseLength != 3 || txLastBits != 0)
		{
			return 1;
		}
		//  Verify CRC_A - do our own calculation and store the control in buffer[2..3] - those bytes are not needed anymore.
	  result = MFRC522_CalculateCRC(responseBuffer, 1, &buffer[2]);
		if(result != UINT8_MAX)
		{
			return result;
		}
		if ((buffer[2] != responseBuffer[1]) || (buffer[3] != responseBuffer[2])) {
			return 2;
		}
		if(responseBuffer[0] & 0x04) // Cascade bit set - UID not complete yes
		{
			cascadeLevel++;
		}
		else
		{
			uidCompleted = 1;
			uid->sak = responseBuffer[0];
		}
	} // End of while(!uidComplete)
	
	// Set correct uid->size
	uid->size = 3 * cascadeLevel + 1;
	
	return UINT8_MAX;
}


/*============================================================================
 *
 * Returns true if a PICC responds to PICC_CMD_REQA.
 * Only "new" cards in state IDLE are invited. Sleeping cards in state HALT are ignored.
 *
 *============================================================================
 */
uint8_t MFRC522_PICC_IsNewCardPresent(void)
{
	uint8_t bufferATQA[2];
	uint8_t bufferSize = sizeof(bufferATQA);
	
	MFRC522_WriteByteReg(TxModeReg, 0x00);
	MFRC522_WriteByteReg(RxModeReg, 0x00);
	MFRC522_WriteByteReg(ModWidthReg, 0x26);
	uint8_t status = MFRC522_PICC_RequestA(bufferATQA, &bufferSize);
	return status;
}


/*============================================================================
 *
 * Simple wrapper around PICC_Select.
 * Returns true if a UID could be read.
 * Remember to call PICC_IsNewCardPresent(), PICC_RequestA() or PICC_WakeupA() first.
 * The read UID is available in the class variable uid.
 *
 *============================================================================
 */
uint8_t MFRC522_PICC_SelectCard(UID *mfrc522)
{
	return MFRC522_PICC_Select(mfrc522);
}

/*============================================================================
 *
 * Enable a secure communication to any MIFARE Mini, MIFARE 1K and MIFARE 4K card
 * Before using this function, you have to SELECT a PICC to get the UID
 * To SELECT a PICC, issue a REQA command then do anticollision loop then SELECT the desired PICC.
 *
 *============================================================================
 */
uint8_t MFRC522_PICC_Authent(uint8_t command, uint8_t blockAddr, uint8_t *sectorKeys, UID *mfrc522)
{
	
	uint8_t waitIRq = 0x10; // IdleIRq register, termination criteria because when authentication failed it does not automatically terminate the cmd
	
	uint8_t buffer[12]; // 10.3.1.9, a total of 12 bytes are written to the FIFO
	uint8_t bufferLen = sizeof(buffer);
	buffer[0] = command; // Authentication command code, either 0x60 (Key A) or 0x61 (Key B)
	buffer[1] = blockAddr;
	// Put sector keys to buffer
	for(uint8_t i = 2; i < 8; i++)
	{
		buffer[i] = sectorKeys[i - 2];
	}
	// Put card serial number (UID) to buffer
	for(uint8_t i = 8; i < 12; i++)
	{
		buffer[i] = mfrc522->uidByte[i - 8];
	}
	MFRC522_PICC_Communication(MFAuthent, waitIRq, buffer, &bufferLen, NULL, NULL, NULL, 0, 0);
	return UINT8_MAX;
}

/*============================================================================
 *
 * Clear MFCrypto1On bit in Status2Reg, should be used if you want to exit MIFARE secure communication
 * You enter a secure communication by using MFRC522_PICC_Authent(...) function;
 *
 *============================================================================
 */
void MFRC522_PICC_StopCrypto(void)
{
	MFRC522_ClearRegisterBitMask(Status2Reg, 0x08); /*Clear MFCrypto1On bit*/
}


/*============================================================================
 *
 * Read 16 bytes + 2 bytes CRC_A from the active PICC
 * For MIFARE Classic the sector containing the block must be authenticated before calling this function.
 * The buffer must be at least 18 bytes because a CRC_A is also returned.
 * Checks the CRC_A before returning STATUS_OK.
 * uint8_t blockAddr (00h to FFh)
 *============================================================================
 */
uint8_t MFRC522_PICC_MIFARE_Read(uint8_t blockAddr, uint8_t *buffer, uint8_t *bufferSize)
{
	uint8_t result;
	
	if(buffer == NULL || *bufferSize < 18)
	{
		return 0;
	}
	
	buffer[0] = 0x30; // https://www.nxp.com/docs/en/data-sheet/MF1S50YYX_V1.pdf - Section 12.2
	buffer[1] = blockAddr;
	// Calculate CRC
	result = MFRC522_CalculateCRC(buffer, 2, &buffer[2]);
	if (result != UINT8_MAX)
	{
		return result; // Error while calculating CRC
	}
	uint8_t sendBuffSize = 4;
	return MFRC522_PICC_TransceiveData(buffer, &sendBuffSize, buffer, bufferSize, NULL, 0, 1);
}


/*============================================================================
 *
 * Write 16 bytes + 2 to the active PICC
 * For MIFARE Classic the sector containing the block must be authenticated before calling this function.
 * The buffer must be at least 18 bytes because a CRC_A is also returned.
 * Checks the CRC_A before returning STATUS_OK.
 * uint8_t blockAddr(00h to FFh)
 *============================================================================
 */
uint8_t MFRC522_PICC_MIFARE_Write(uint8_t blockAddr, uint8_t *buffer, uint8_t bufferSize)
{
	uint8_t result;
	
