KizEvo/stm32-rfid-sdcard-servo-test/Src/mfrc522.c
	if(buffer == NULL || bufferSize < 16)
	{
		return 0;
	}
	
	// MIFARE Classic protocol requires two communications to perform a write.
	// Step1 tell the PICC we want to write to block "blockAddr"
	uint8_t commandBuffer[2];
	commandBuffer[0] = 0xA0; // https://www.nxp.com/docs/en/data-sheet/MF1S50YYX_V1.pdf - Section 12.3
	commandBuffer[1] = blockAddr;
	result = MFRC522_PICC_MIFARE_Tranceive(commandBuffer, 2, 0);
	if(result != UINT8_MAX)
	{
		return result;
	}
	
	// Step2 transfer the data
	result = MFRC522_PICC_MIFARE_Tranceive(buffer, bufferSize, 0);
	if(result != UINT8_MAX)
	{
		return result;
	}
	return UINT8_MAX;
}

/*============================================================================
 *
 * Wrapper for MIFARE protocol communication
 * Adds CRC_A, executes the Transceive command and checks that the response is MF_ACK or a timeout. 
 *
 *============================================================================
 */
uint8_t MFRC522_PICC_MIFARE_Tranceive(uint8_t *sendData, uint8_t sendLen, uint8_t acceptTimeout)
{
	uint8_t result;
	uint8_t commandBuffer[18]; // 16 bytes data and 2 bytes CRC_A
	if(sendData == NULL || sendLen > 16)
	{
		return 0;
	}
	for(uint8_t i = 0; i < sendLen; i++) // Copy sendData to commandBuffer
	{
		commandBuffer[i] = sendData[i];
	}
	result = MFRC522_CalculateCRC(commandBuffer, sendLen, &commandBuffer[sendLen]);
	if(result != UINT8_MAX)
	{
		return result;
	}
	sendLen += 2;
	
	// Transceive data, store reply in commandBuffer[]
	uint8_t waitIRq = 0x30;
	uint8_t commandBufferSize = sizeof(commandBuffer);
	uint8_t validBits = 0;
	result = MFRC522_PICC_Communication(Transceive, waitIRq, commandBuffer, &sendLen, commandBuffer, &commandBufferSize, &validBits, 0, 0);
	if(acceptTimeout && result == 0)
	{
		return UINT8_MAX;
	}
	if(result != UINT8_MAX)
	{
		return result;
	}
	// The PICC must reply with a 4 bit ACK
	if(commandBufferSize != 1 || validBits != 4)
	{
		return 1; // ERROR
	}
	if(commandBuffer[0] != 0xA)
	{
		return 2; // MIFARE NACK
	}
	return UINT8_MAX; // Success
}

/*============================================================================
 *
 * Dump card UID to UART
 *
 *============================================================================
 */
void MFRC522_DumpUID(UID *mfrc522)
{
	UART_WriteString(USART1, "UID (in hex): ");
	for(uint8_t i = 0; i < mfrc522->size; i++)
	{
		UART_WriteHex(USART1, mfrc522->uidByte[i]);
		UART_WriteString(USART1, " ");
	}
	UART_WriteString(USART1, "         ");
	UART_WriteString(USART1, "MIFARE type: ");
	UART_WriteHex(USART1, mfrc522->sak);
	UART_WriteString(USART1, "         ");
}

/*============================================================================
 *
 * Translates the SAK (Select Acknowledge) to a PICC type.
 *
 *============================================================================
 */
PICC_TYPE MFRC522_GetType(uint8_t sak)
{
	// Application Note AN10833
	// Coding of Select Acknowledge (SAK)
	// ignore 8-bit (iso14443 starts with LSBit = bit 1)
	sak &= 0x7F;
	switch (sak) {
		case 0x04:	return PICC_TYPE_NOT_COMPLETE;	// UID not complete
		case 0x09:	return PICC_TYPE_MIFARE_MINI;
		case 0x08:	return PICC_TYPE_MIFARE_1K;
		case 0x18:	return PICC_TYPE_MIFARE_4K;
		case 0x00:	return PICC_TYPE_MIFARE_UL;
		case 0x10:
		case 0x11:	return PICC_TYPE_MIFARE_PLUS;
		case 0x01:	return PICC_TYPE_TNP3XXX;
		case 0x20:	return PICC_TYPE_ISO_14443_4;
		case 0x40:	return PICC_TYPE_ISO_18092;
		default:	return PICC_TYPE_UNKNOWN;
	}
}


/*============================================================================
 *
 * Perform a digital self test. The self test is started by using the following procedure:
 * 1. Perform a soft reset.
 * 2. Clear the internal buffer by writing 25 bytes of 00h and implement the Config command.
 * 3. Enable the self test by writing 09h to the AutoTestReg register.
 * 4. Write 00h to the FIFO buffer.
 * 5. Start the self test with the CalcCRC command.
 * 6. The self test is initiated.
 * 7. When the self test has completed, the FIFO buffer contains the following 64 bytes:
 *
 *============================================================================
 */
void MFRC522_PICC_TestSignal(uint8_t *bufferOut)
{
	// 1. Soft reset
	MFRC522_SOFT_RESET;
	
	// 2. Clear internal buffer
	uint8_t bufferIn[25] = {0x00};
	MFRC522_WriteByteReg(FIFOLevelReg, 0x80); // flush FIFO
	MFRC522_WriteStreamReg(FIFODataReg, bufferIn, 25); // write 25 zero bytes
	MFRC522_WriteByteReg(CommandReg, Mem); // transfer 25 bytes to internal buffer
	// 3. Enable self test
	MFRC522_WriteByteReg(AutoTestReg, 0x09);
	// 4. Write 0x00 to the FIFO buffer
	MFRC522_WriteByteReg(FIFODataReg, 0x00);
	// 5. Perform self test with CalcCRC command
	MFRC522_WriteByteReg(CommandReg, CalcCRC);
	
	// Wait for self test
	while(MFRC522_ReadByteReg(FIFOLevelReg) < 64);
	
	MFRC522_WriteByteReg(CommandReg, Idle);
	// Done, reading 64 bytes from FIFO
	MFRC522_ReadStreamReg(FIFODataReg, bufferOut, 64);
	// Reset AutoTestReg
	MFRC522_WriteByteReg(AutoTestReg, 0x00);
	// Re-init
	MFRC522_Init();
}
